Revit 2025 API
BehaviorType Enumeration
 An enumerated type listing all the behavior type for MEP Components.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum BehaviorType
Public Enumeration BehaviorType
public enum class BehaviorType
type BehaviorType
Members
Member name | Value | Description
Invalid | 0 |  BehaviorType is Invalid
Normal | 1 |  BehaviorType is Normal
Bend | 2 |  BehaviorType is Bend
Branch | 4 |  BehaviorType is Branch
Intersection | 8 |  BehaviorType is Intersection
Inline | 16 |  BehaviorType is Inline
BreakInto | 32 |  BehaviorType is Break Into
OrientToObject | 64 |  BehaviorType is Orient to Object
OrientToCenterLine | 128 |  BehaviorType is Orient to CenterLine
OrientToFace | 256 |  BehaviorType is Orient to Face
SystemMember | 512 |  BehaviorType is System Member
BaseObject | 1,024 |  BehaviorType is Base Object
EndCap | 2,048 |  BehaviorType is End Cap
Valve | 4,096 |  BehaviorType is Valve
Flange | 8,192 |  BehaviorType is Flange
MechanicalCoupling | 16,384 |  BehaviorType is Mechanical Coupling
VerticalBend | 32,768 |  BehaviorType is Vertical Bend
ElectricalBaseObject | 65,536 |  BehaviorType is Electrical Base Object
Straight | 131,072 |  BehaviorType is Straight
Flex | 262,144 |  BehaviorType is Flex
Hanger | 524,288 |  BehaviorType is Hanger
Flat_Tap | 1,048,576 |  BehaviorType is a flat tap on flat surface, eg. rectangular straight or flat-side of oval straight
Coupling | 2,097,152 |  BehaviorType is Coupling
Round_CentreLine_Tap | 4,194,304 |  BehaviorType is a round centreline tap on round straight/pipe
Oval_CentreLine_Tap | 8,388,608 |  BehaviorType is a round centreline tap on oval straight
Damper | 16,777,216 |  BehaviorType is a round centreline tap on oval straight
See Also
Reference
Autodesk.Revit.DB Namespace